{
  "0.25": "01/22/2026 03:15 PM \n\nPaused Discord join link!",
  "0.24": "07/04/2025 03:30 PM \n\nSpace added! \n\nTo unlock, visit shop! Must have at least 100 unique fish caught and 100k mana. \n\nAdded new icons from space to celebrate!",
  "0.23": "06/20/2025 05:55 PM \n\nAdded borders! You can now spend mana on more cosmetics! Good luck on your gacha! \n\nAdded Again button so you can gacha faster! \n\nLeaderboard extended to top 20 players!",
  "0.22": "06/17/2025 01:50 PM \n\nRemoved patch 0.21, instead will retrive save data from server on tabbing back in. \n\nLet me know if any issues occur.",
  "0.21": "06/17/2025 10:00 AM \n\nLogs user out on tab close. \n\nPlease let me know on Discord suggestions if this is an issue.",
  "0.20": "06/16/2025 04:45 PM \n\nWorked on saving issues. Let me know if bugs! \n\nImproved QoL for fishing! \n\nAdded more pretty!",
  "0.19": "06/12/2025 11:45 PM \n\nYou can now access audio, icons, and fishionary while fishing.",
  "0.18": "06/12/2025 12:05 AM \n\nAdded more icons in the normal gacha.",
  "0.17": "06/10/2025 10:00 PM \n\nAdded a timer to track time in fishing lobby!",
  "0.16": "06/10/2025 04:25 PM \n\nAdded a surprise that randomly appears!",
  "0.15": "06/09/2025 07:00 PM \n\nAdded profile icons on leaderboard. \n\nAdded Discord link for bugs.",
  "0.14": "06/08/2025 02:15 PM \n\nSave system updated, please reach out to me or aivy for save issues. \n\nDon't need to log out (log out is recommended for reliable save), can sign in from different devices and will log out last session. \n\nNow everything will be saved directly to server instead of local storage.",
  "0.13": "06/06/2025 05:15 PM \n\nSaves slightly more frequently (still working on it). Added version number on bottom right. Added voicelines.",
  "0.12": "06/05/2025 09:10 PM \n\nScary save bug was not fixed, hopefully it is now. Added icons for navigation bubbles.",
  "0.11": "06/05/2025 04:10 PM \n\nAdded teaser to shop. Fixed scary bug with logout button.",
  "0.10": "06/05/2025 08:17 AM \n\nAdded renamed Logout to Save & Logout and placed it everywhere.",
  "0.09": "06/04/2025 10:33 PM \n\nAdded animation and pointer cursor when hovering over buttons.",
  "0.08": "06/04/2025 09:17 PM \n\nUpdated coin flip to look cooler and have cool sounds to be cooler. Also added PST because I was yelled at.",
  "0.07": "06/04/2025 08:39 PM \n\nNow stores audio controls from last session. Fixed Bet All when below minimum bet. Added 2 more premium icons.",
  "0.06": "06/04/2025 07:10 PM \n\nAdded PREMIUM icons. Check shop.",
  "0.05": "06/04/2025 04:25 PM \n\nshe wanted the time too.",
  "0.04": "06/04/2025 04:23 PM \n\niv forced me to add date to my patch notes.",
  "0.03": "06/04/2025 03:30 PM \n\nAdded coin history for the last 10 flips for coin flip.",
  "0.02": "06/04/2025 03:15 PM \n\nAdded weather to fishing. \n\nNight time = Increase Rates \n\nDay time = Decrease Rates",
  "0.01": "06/04/2025 03:15 PM \n\nStarting patch notes!"
}
